---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AutoPanel
source: html/5bb1f156-f5c1-a87c-e212-c16ff20f639a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AutoPanel Property

"Curtain Panel"

## Syntax (C#)
```csharp
public static ForgeTypeId AutoPanel { get; }
```